Revit 2027 API
StructuralConnectionType.ValidFamilySymbolId Method
 Checks whether the family symbol id is allowed for StructuralConnectionTypes with the given value for the applyTo property.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ValidFamilySymbolId(
	Document doc,
	StructuralConnectionApplyTo applyTo,
	ElementId familySymbolId
)
Public Shared Function ValidFamilySymbolId (
	doc As Document,
	applyTo As StructuralConnectionApplyTo,
	familySymbolId As ElementId
) As Boolean
public:
static bool ValidFamilySymbolId(
	Document^ doc,
	StructuralConnectionApplyTo applyTo,
	ElementId^ familySymbolId
)
static member ValidFamilySymbolId :
        doc : Document *
        applyTo : StructuralConnectionApplyTo *
        familySymbolId : ElementId -> bool
Parameters
doc Document
applyTo StructuralConnectionApplyTo
familySymbolId ElementId
Return Value
Boolean
 True if %familySymbolId% is invalidElementId; or if it is the id of a FamilySymbol of category "Connection Symbols" (OST_StructConnectionSymbols) with its "Apply To" parameter set to match the applyTo property. Returns false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace